# 1. Напишіть функцію, що приймає один аргумент будь-якого типу
# та повертає цей аргумент, перетворений на float.
# Якщо перетворити не вдається функція має повернути 0.
def my_function(arg):
    try:
        return float(arg)
    except:
        return 0


# 2. Напишіть функцію, що приймає два аргументи.
# Функція повинна:
#
# якщо аргументи відносяться до числових типів (int, float)
# - повернути перемножене значення цих аргументів,
#
# якщо обидва аргументи це строки (str)
# - обʼєднати в одну строку та повернути
#
# у будь-якому іншому випадку повернути кортеж з цих аргументів
#

def multiply_args(arg1, arg2):
    if type(arg1) in (int, float) and type(arg2) in (int, float):
        return arg1 * arg2
    elif type(arg1) is str and type(arg2) is str:
        return arg1 + arg2
    else:
        return (arg1, arg2)



# 3.Перепишіть за допомогою функцій вашу программу "Касир в кінотеатрі",
# яка буде виконувати наступне:

# Попросіть користувача ввести свсвій вік.

# - якщо користувачу менше 7 - вивести:
# "Тобі ж <> <>! Де твої батьки?"

# - якщо користувачу менше 16 - вивести:
# "Тобі лише <> <>, а це е фільм для дорослих!"

# - якщо користувачу більше 65 - вивести:
# "Вам <> <>? Покажіть пенсійне посвідчення!"

# - якщо вік користувача містить 7 - вивести
# "Вам <> <>, вам пощастить"

# - у будь-якому іншому випадку - вивести
# "Незважаючи на те, що вам <> <>, білетів всеодно нема!"


# Замість <> <> в кожну відповідь підставте значення віку (цифру)
# та правильну форму слова рік. Для будь-якої відповіді форма слова "рік" має
# відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...)

# . Наприклад :

# "Тобі ж 5 років! Де твої батьки?"
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
# "Незважаючи на те, що вам 42 роки, білетів всеодно нема!"


def verif_age():
    while True:
        try:
            age = int(input("Введіть ваш вік: "))
            if 0 <= age <= 124:
                return age
            else:
                print("Введіть вік в діапазоні від 0 до 124 років.")
        except ValueError:
            print("Введіть, будь ласка, ціле число")


def determine_year_form(age):
    last_digit = age % 10
    last_two_digits = age % 100
    if last_two_digits >= 11 and last_two_digits <= 14:
        return "років"
    elif last_digit == 1:
        return "рік"
    elif last_digit >= 2 and last_digit <= 4:
        return "роки"
    else:
        return "років"


def print_message(age):
    year_form = determine_year_form(age)
    if '7' in str(age):
        print(f"Вам {age} {year_form}, вам пощастить")
    elif age < 7:
        print(f"Тобі ж {age} {year_form}! Де твої батьки?")
    elif age < 16:
        print(f"Тобі лише {age} {year_form}, а це фільм для дорослих!")
    elif age > 65:
        print(f"Вам {age} {year_form}? Покажіть пенсійне посвідчення!")
    else:
        print(
            f"Незважаючи на те, що вам {age} {year_form}, білетів всеодно нема!")


age = verif_age()
print_message(age)